lojadecamisetas/app/controllers/produtos_controller.rb

	def set_produto
		id = params[:id]
		@produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 6]]