lojadecamisetas/app/controllers/produtos_controller.rb

	def index
		@produtos_por_preco = Produto.order(:nome).limit 2
		@produtos_por_nome = Produto.order(:preco).limit 5
---
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2

	def create
		valores = params.require(:produto).permit :nome, :preco, :descricao, :quantidae, :departamento_id
		@produto = Produto.create valores
---
INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "teste 2"], ["descricao", "trdy"], ["quantidade", 4], ["preco", 44.0], ["created_at", "2017-11-19 01:30:42.142497"], ["updated_at", "2017-11-19 01:30:42.142497"]]

	def new
		@produto = Produto.new
		@departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

	def destroy
		id = params[:id]
		Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 6]]

	def busca

		@nome_a_buscar = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%vikings%')